mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
//{{{
class cFontChar {
public:
  void* operator new (std::size_t size) { return pvPortMalloc (size); }
  void operator delete (void *ptr) { myFree (ptr); }

  uint8_t* bitmap;
  int16_t left;
  int16_t top;
  int16_t pitch;
  int16_t rows;
  int16_t advance;
  };
//}}}
typedef std::map<uint16_t, cFontChar*> cFontCharMap;
cFontCharMap mFontCharMap;

static FT_Library FTlibrary;
static FT_Face FTface;
static FT_GlyphSlot FTglyphSlot;
//}}}

LTDC_HandleTypeDef hLtdc;
//{{{
void LCD_LTDC_IRQHandler() {

  if (LTDC->ISR & LTDC_IT_FU) ltdc.fifoUnderunIrq++;
  if (LTDC->ISR & LTDC_IT_TE) ltdc.transferErrorIrq++;

  // line interrupt
  if (LTDC->ISR & LTDC_IT_LI) {
    // switch showFrameBuffer
    LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
    ltdcLayer->CFBAR = showFrameBufferAddress[0];
    if (showAlpha[0]) {
      ltdcLayer->CR |= LTDC_LxCR_LEN;
      ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
      ltdcLayer->CACR = showAlpha[0];
      }
    else
      ltdcLayer->CR &= ~LTDC_LxCR_LEN;
    LTDC->SRCR |= LTDC_SRCR_IMR;

    ltdc.lineTicks = osKernelSysTick() - ltdc.lastTicks;
    ltdc.lastTicks = osKernelSysTick();
    ltdc.lineIrq++;

    if (ltdc.frameWait)
      osSemaphoreRelease (ltdc.sem);
    ltdc.frameWait = 0;
    }

  LTDC->ICR = LTDC_FLAG_LI | LTDC_FLAG_FU | LTDC_FLAG_TE;
  }
//}}}
//{{{
void LCD_DMA2D_IRQHandler() {

  // clear interrupts
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  while (true) {
    uint32_t opcode = *mDma2dIsrBuf++;
    switch (opcode) {
      case kEnd:
        DMA2D->CR = 0;
        mDma2dIsrBuf = mDma2dBuf;
        osSemaphoreRelease (mDma2dSem);
        return;

      case kStamp:
        DMA2D->OMAR    = *mDma2dIsrBuf;   // output start address
        DMA2D->BGMAR   = *mDma2dIsrBuf++; // - repeated to bgnd start addres
        DMA2D->OOR     = *mDma2dIsrBuf;   // output stride
        DMA2D->BGOR    = *mDma2dIsrBuf++; // - repeated to bgnd stride
        DMA2D->NLR     = *mDma2dIsrBuf++; // width:height
        DMA2D->FGMAR   = *mDma2dIsrBuf++; // fgnd start address
        DMA2D->FGPFCCR = DMA2D_INPUT_A8;  // fgnd PFC
        DMA2D->FGOR    = 0;               // fgnd stride
        DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        return;

      default: // opcode==address : value
        *(uint32_t*)opcode = *mDma2dIsrBuf++;
        if (opcode == AHB1PERIPH_BASE + 0xB000U) // CR
          return;
      }
    }
  }
//}}}

// cLcd
//{{{
cLcd::cLcd (uint32_t buffer0, uint32_t buffer1)  {

  mBuffer[false] = buffer0;
  mBuffer[true] = buffer1;

  updateNumDrawLines();
  }
//}}}
cLcd::~cLcd() {}

// static
cLcd* cLcd::mLcd = nullptr;
//{{{
cLcd* cLcd::create (std::string title, bool isr) {

  if (!mLcd) {
    mLcd = new cLcd (SDRAM_FRAME0, SDRAM_FRAME1);
    mLcd->mIsr = isr;
    mLcd->init (title);
    }

  return mLcd;
  }
//}}}

// public members
//{{{
void cLcd::setTitle (std::string title) {
  mTitle = title;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

  mShowTitle = title;
  mShowInfo = info;
  mShowLcdStats = lcdStats;
  mShowFooter = footer;

  updateNumDrawLines();
  }
//}}}

//{{{
void cLcd::info (std::string str) {
  info (COL_WHITE, str);
  }
//}}}
//{{{
void cLcd::info (uint32_t colour, std::string str) {

  bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

  auto line = (mLastLine < mMaxLine-1) ? mLastLine+1 : mLastLine;
  mLines[line].mTime = osKernelSysTick();
  mLines[line].mColour = colour;
  mLines[line].mString = str;
  mLastLine = line;

  if (tailing)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  }
//}}}

//{{{
void cLcd::press (int pressCount, int16_t x, int16_t y, uint16_t z, int16_t xinc, int16_t yinc) {

  if ((pressCount > 30) && (x <= mStringPos) && (y <= cWidget::getBoxHeight()))
    reset();
  else if (pressCount == 0) {
    if (x <= mStringPos) {
      // set displayFirstLine
      if (y < 2 * cWidget::getBoxHeight())
        displayTop();
      else if (y > getLcdHeightPix() - 2 * cWidget::getBoxHeight())
        displayTail();
      }
    }
  else {
    // inc firstLine
    float value = mFirstLine - ((2.0f * yinc) / cWidget::getBoxHeight());

    if (value < 0)
      mFirstLine = 0;
    else if (mLastLine <= (int)mNumDrawLines-1)
      mFirstLine = 0;
    else if (value > mLastLine - mNumDrawLines + 1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = value;
    }
  }
//}}}

//{{{
void cLcd::startRender() {

  mDrawBuffer = !mDrawBuffer;
  setLayer (0, mBuffer[mDrawBuffer]);

  // frameSync;
  ltdc.frameWait = 1;
  if (osSemaphoreWait (ltdc.sem, 100) != osOK)
    ltdc.timeouts++;

  mDrawStartTime = osKernelSysTick();
  }
//}}}
//{{{
void cLcd::renderCursor (uint32_t colour, int16_t x, int16_t y, int16_t z) {
  ellipse (colour, x, y, z, z);
  }
//}}}
//{{{
void cLcd::endRender (bool forceInfo) {

  auto y = 0;
  if ((mShowTitle || forceInfo) && !mTitle.empty()) {
    //{{{  draw title
    text (COL_YELLOW, cWidget::getFontHeight(), mTitle, 0, y, getLcdWidthPix(), cWidget::getBoxHeight());
    y += cWidget::getBoxHeight();
    }
    //}}}
  if (mShowInfo || forceInfo) {
    //{{{  draw info lines
    if (mLastLine >= 0) {
      // draw scroll bar
      auto yorg = cWidget::getBoxHeight() + ((int)mFirstLine * mNumDrawLines * cWidget::getBoxHeight() / (mLastLine + 1));
      auto height = mNumDrawLines * mNumDrawLines * cWidget::getBoxHeight() / (mLastLine + 1);
      rectClipped (COL_YELLOW, 0, yorg, 8, height);
      }

    auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
    if (lastLine > mLastLine)
      lastLine = mLastLine;
    for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
      auto x = 0;
      auto xinc = text (COL_GREEN, cWidget::getFontHeight(),
                        dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                        dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getLcdWidthPix(), cWidget::getBoxHeight());
      x += xinc + 3;
      text (mLines[lineIndex].mColour, cWidget::getFontHeight(), mLines[lineIndex].mString, x, y, getLcdWidthPix(), cWidget::getBoxHeight());
      y += cWidget::getBoxHeight();
      }
    }
    //}}}
  if (mShowLcdStats) {
    //{{{  draw lcdStats
    std::string str = dec (ltdc.lineIrq) + ":f " +
                      dec (ltdc.lineTicks) + "ms " +
                      dec (mDma2dTimeouts) + " " +
                      dec (ltdc.transferErrorIrq) + " " +
                      dec (ltdc.fifoUnderunIrq);
    text (COL_WHITE, cWidget::getFontHeight(), str, 0, getLcdHeightPix() - 2 * cWidget::getBoxHeight(), getLcdWidthPix(), 24);
    }
    //}}}
  if (mShowFooter || forceInfo)
    //{{{  draw footer
    text (COL_YELLOW, cWidget::getFontHeight(),
          dec (xPortGetFreeHeapSize()) + " " + dec (osGetCPUUsage()) + "% " + dec (mDrawTime) + "ms " + dec (mDma2dCurBuf - mDma2dBuf),
          0, -cWidget::getFontHeight() + getLcdHeightPix(), getLcdWidthPix(), cWidget::getFontHeight());
    //}}}

  // terminate opCode buffer
  *mDma2dCurBuf = kEnd;

   // send opCode buffer
  LCD_DMA2D_IRQHandler();

  // wait
  if (osSemaphoreWait (mDma2dSem, 500) != osOK)
    mDma2dTimeouts++;
  showLayer (0, mBuffer[mDrawBuffer], 255);

  // reset opcode buffer
  mDma2dCurBuf = mDma2dBuf;
  *mDma2dCurBuf = kEnd;

  mDrawTime = osKernelSysTick() - mDrawStartTime;
  }
//}}}
//{{{
void cLcd::flush() {

