mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  clear (COL_BLACK);

  auto y = 0;
  if (!mTitle.empty()) {
    //{{{  draw title
    text (COL_YELLOW, cWidget::getFontHeight(), mTitle, 0, y, getLcdWidthPix(), cWidget::getBoxHeight());
    y += cWidget::getBoxHeight();
    }
    //}}}
  //{{{  draw info lines
  if (mLastLine >= 0) {
    // draw scroll bar
    auto yorg = cWidget::getBoxHeight() + ((int)mFirstLine * mNumDrawLines * cWidget::getBoxHeight() / (mLastLine + 1));
    auto height = mNumDrawLines * mNumDrawLines * cWidget::getBoxHeight() / (mLastLine + 1);
    rectClipped (COL_YELLOW, 0, yorg, 8, height);
    }

  auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
  if (lastLine > mLastLine)
    lastLine = mLastLine;
  for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
    auto x = 0;
    auto xinc = text (COL_GREEN, cWidget::getFontHeight(),
                      dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                      dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getLcdWidthPix(), cWidget::getBoxHeight());
    x += xinc + 3;
    text (mLines[lineIndex].mColour, cWidget::getFontHeight(), mLines[lineIndex].mString, x, y, getLcdWidthPix(), cWidget::getBoxHeight());
    y += cWidget::getBoxHeight();
    }
  //}}}
  //{{{  draw footer
  text (COL_YELLOW, cWidget::getFontHeight(),
        dec (xPortGetFreeHeapSize()) + " " +
        dec (osGetCPUUsage()) + "% " +
        dec (mDrawTime) + "ms " +
        dec (mDma2dCurBuf - mDma2dBuf),
        0, getLcdHeightPix()-cWidget::getBoxHeight(), getLcdWidthPix(), cWidget::getBoxHeight());
  //}}}
  *mDma2dCurBuf = kEnd;

  mDrawBuffer = false;
  mCurFrameBufferAddress = SDRAM_FRAME0;
  mSetFrameBufferAddress[0] = SDRAM_FRAME0;

  mDrawStartTime = osKernelSysTick();

  // clear interrupts
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  uint32_t opcode = *mDma2dIsrBuf++;
  while (opcode != kEnd) {
    if (opcode == kStamp) {
      DMA2D->OMAR   = *mDma2dIsrBuf;   // bgnd dst start address
      DMA2D->BGMAR  = *mDma2dIsrBuf++; // - repeated to bgnd src start addres
      DMA2D->OOR    = *mDma2dIsrBuf;   // bgnd dst stride
      DMA2D->BGOR   = *mDma2dIsrBuf++; // - repeated to bgnd src stride
      DMA2D->NLR    = *mDma2dIsrBuf++; // width:height
      DMA2D->FGMAR  = *mDma2dIsrBuf++; // src start address
      DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
      while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
      DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                    DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
      }
    else {
      *(uint32_t*)opcode = *mDma2dIsrBuf++;
      if (opcode == AHB1PERIPH_BASE + 0xB000U) {
        while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
        DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                      DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
        }
      }
    opcode = *mDma2dIsrBuf++;
    }
  mDrawTime = osKernelSysTick() - mDrawStartTime;

  showFrameBufferAddress[0] = SDRAM_FRAME0;
  showAlpha[0] = 255;
  LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
  ltdcLayer->CFBAR = showFrameBufferAddress[0];
  ltdcLayer->CR |= LTDC_LxCR_LEN;
  ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
  ltdcLayer->CACR = 255;
  LTDC->SRCR |= LTDC_SRCR_IMR;

  mDma2dIsrBuf = mDma2dBuf;
  mDma2dCurBuf = mDma2dBuf;
  *mDma2dCurBuf = kEnd;
  }
//}}}

//{{{
void cLcd::displayOn() {

  #ifdef STM32F746xx
    // enable LTDC
    LTDC->GCR |= LTDC_GCR_LTDCEN;

    // turn on DISP pin
    HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);        /* Assert LCD_DISP pin */

    // turn on backlight
    HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);  /* Assert LCD_BL_CTRL pin */
  #else
    /* Send Display on DCS command to display */
    HAL_DSI_ShortWrite (&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1,
                        OTM8009A_CMD_DISPON, 0x00);
  #endif
  }
//}}}
//{{{
void cLcd::displayOff() {

   #ifdef STM32F746xx
    // disable LTDC
    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

    // turn off DISP pin
    HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_RESET);      /* De-assert LCD_DISP pin */

    // turn off backlight
    HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);/* De-assert LCD_BL_CTRL pin */
  #else
    /* Send Display off DCS Command to display */
    HAL_DSI_ShortWrite (&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1,
                        OTM8009A_CMD_DISPOFF, 0x00);
  #endif
  }
//}}}

// iDraw
//{{{
void cLcd::pixel (uint32_t colour, int16_t x, int16_t y) {

  rect (colour, x, y, 1, 1);
  }
//}}}
//{{{
void cLcd::rect (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  // often same colour
  if (colour != mCurDstColour) {
    *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x38; // OCOLR - output colour
    *mDma2dCurBuf++ = colour;
    mCurDstColour = colour;
    }

  // quite often same stride
  if (getLcdWidthPix() - width != mDstStride) {
    *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x40; // OOR - output stride
    mDstStride = getLcdWidthPix() - width;
    *mDma2dCurBuf++ = mDstStride;
    }

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x3C; // OMAR - output start address
  *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x44; // NLR
  *mDma2dCurBuf++ = (width << 16) | height;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U;        // CR
  *mDma2dCurBuf++ = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
  }
//}}}
//{{{
void cLcd::stamp (uint32_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  // often same colour
  if (colour != mCurSrcColour) {
    *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x20; // FGCOLR - fgnd colour
    *mDma2dCurBuf++ = colour;
    mCurSrcColour = colour;
    }

