mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  *mDma2dCurBuf++ = kStamp;
  *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents; // output start address
  mDstStride = getLcdWidthPix() - width;
  *mDma2dCurBuf++ = mDstStride;                                          // stride
  *mDma2dCurBuf++ = (width << 16) | height;                              // width:height
  *mDma2dCurBuf++ = (uint32_t)src;                                       // fgnd start address
  }
//}}}
//{{{
int cLcd::text (uint32_t colour, uint16_t fontHeight, std::string str, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  auto xend = x + width;
  for (auto i = 0; i < str.size(); i++) {
    if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
      auto fontCharIt = mFontCharMap.find (fontHeight<<8 | str[i]);
      auto fontChar = (fontCharIt == mFontCharMap.end()) ?  loadChar (fontHeight, str[i]) : fontCharIt->second;
      if (x + fontChar->left + fontChar->pitch >= xend)
        break;
      else if (fontChar->bitmap)
        stampClipped (colour, fontChar->bitmap, x + fontChar->left, y + fontHeight - fontChar->top, fontChar->pitch, fontChar->rows);

      x += fontChar->advance;
      }
    }

  return x;
  }
//}}}
//{{{
void cLcd::copy (uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {
// copy RGB888 to ARGB8888

  // output
  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x3C; // OMAR - output start address
  *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents;

  mDstStride = getLcdWidthPix() - width;
  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x40; // OOR - output stride
  *mDma2dCurBuf++ = mDstStride;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x44; // NLR - width:height
  *mDma2dCurBuf++ = (width << 16) | height;


  // src - fgnd
  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x1C; // FGPFCCR - fgnd PFC
  *mDma2dCurBuf++ = DMA2D_INPUT_RGB888;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x0C; // FGMAR - fgnd address
  *mDma2dCurBuf++ = (uint32_t)src;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x10; // FGOR - fgnd stride
  *mDma2dCurBuf++ = 0;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U;        // CR
  *mDma2dCurBuf++ = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
  }
//}}}
//{{{
void cLcd::copy (uint8_t* src, int16_t srcx, int16_t srcy, uint16_t srcWidth, int16_t srcHeight,
                 int16_t dstx, int16_t dsty, uint16_t dstWidth, uint16_t dstHeight) {
// copy src to dst
// - some corner cases missing, not enough src for dst needs padding

  // output
  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x3C; // OMAR - output start address
  *mDma2dCurBuf++ = mCurFrameBufferAddress + ((dsty * getLcdWidthPix()) + dstx) * dstComponents;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x40; // OOR - output stride
  mDstStride = getLcdWidthPix() - dstWidth;
  *mDma2dCurBuf++ = mDstStride;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x44; // NLR - width:height
  *mDma2dCurBuf++ = (dstWidth << 16) | dstHeight;

  // src - fgnd
  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x1C; // FGPFCCR - fgnd PFC
  *mDma2dCurBuf++ = DMA2D_INPUT_RGB888;

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x0C; // FGMAR - fgnd address
  *mDma2dCurBuf++ = (uint32_t)(src + ((srcy * srcWidth) + srcx) * dstComponents);

  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U + 0x10; // FGOR - fgnd stride
  *mDma2dCurBuf++ = srcWidth - dstWidth;

  // CR
  *mDma2dCurBuf++ = AHB1PERIPH_BASE + 0xB000U;        // CR
  *mDma2dCurBuf++ = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
  }
//}}}

// private
//{{{
void cLcd::init (std::string title) {

  mDrawBuffer = !mDrawBuffer;
  ltdcInit (mBuffer[mDrawBuffer]);

  //  dma2d init
  // unchanging dma2d regs
  #ifdef USE_RGB888
    DMA2D->OPFCCR  = DMA2D_INPUT_RGB888; // dst  PFC
    DMA2D->BGPFCCR = DMA2D_INPUT_RGB888; // bgnd PFC
  #else
    DMA2D->OPFCCR  = DMA2D_INPUT_ARGB8888;
    DMA2D->BGPFCCR = DMA2D_INPUT_ARGB8888;
  #endif
  //DMA2D->AMTCR = 0x1001;

  // zero out first opcode, point past it
  mDma2dBuf = (uint32_t*)DMA2D_BUFFER;
  mDma2dIsrBuf = mDma2dBuf;
  mDma2dCurBuf = mDma2dBuf;
  *mDma2dCurBuf = kEnd;

  if (mIsr) {
    osSemaphoreDef (dma2dSem);
    mDma2dSem = osSemaphoreCreate (osSemaphore (dma2dSem), -1);

    // dma2d IRQ init
    HAL_NVIC_SetPriority (DMA2D_IRQn, 0x0F, 0);
    HAL_NVIC_EnableIRQ (DMA2D_IRQn);
    }

  // font init
  setFont (freeSansBold, freeSansBold_len);
  //setFont ((uint8_t*)0x90000000, 64228);

  // prewarm cache
  for (char ch = 0x20; ch <= 0x7F; ch++)
    loadChar (cWidget::getFontHeight(), ch);
  for (char ch = 0x20; ch <= 0x7F; ch++)
    loadChar (cWidget::getBigFontHeight(), ch);
  for (char ch = 0x20; ch <= 0x7F; ch++)
    loadChar (cWidget::getSmallFontHeight(), ch);

  setTitle (title);
  }
//}}}
//{{{
void cLcd::ltdcInit (uint32_t frameBufferAddress) {

  hLtdc.Instance = LTDC;
  //{{{  common clock enables
  __HAL_RCC_LTDC_CLK_ENABLE();
  __HAL_RCC_DMA2D_CLK_ENABLE();
  //}}}

  #ifdef STM32F746G_DISCO
    //{{{  gpio clock enables
    // enable GPIO clock, includes backlight, display enable
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOI_CLK_ENABLE();
    __HAL_RCC_GPIOJ_CLK_ENABLE();
    __HAL_RCC_GPIOK_CLK_ENABLE();
    //}}}
    //{{{  pll config
    // - PLLSAI_VCO In  = HSE_VALUE / PLLM                        = 1 Mhz
    // - PLLSAI_VCO Out = PLLSAI_VCO Input * PLLSAIN              = 192 Mhz
    // - PLLLCDCLK      = PLLSAI_VCO Output / PLLSAIR    = 192/5  = 38.4 Mhz
    // - LTDC clock     = PLLLCDCLK / LTDC_PLLSAI_DIVR_4 = 38.4/4 = 9.6Mhz
    RCC_PeriphCLKInitTypeDef periph_clk_init_struct;
    periph_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
    periph_clk_init_struct.PLLSAI.PLLSAIN = 192;
    periph_clk_init_struct.PLLSAI.PLLSAIR = 5; // could be 7
    periph_clk_init_struct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
    HAL_RCCEx_PeriphCLKConfig (&periph_clk_init_struct);
    //}}}
    //{{{  LTDC pin config
    // GPIOE config
    GPIO_InitTypeDef gpio_init_structure;
    gpio_init_structure.Pin       = GPIO_PIN_4;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FAST;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init (GPIOE, &gpio_init_structure);

    // GPIOG config
    gpio_init_structure.Pin       = GPIO_PIN_12;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF9_LTDC;
    HAL_GPIO_Init (GPIOG, &gpio_init_structure);

    // GPIOI LTDC alternate config
    gpio_init_structure.Pin       = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init (GPIOI, &gpio_init_structure);

    // GPIOJ config
    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
                                    GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
                                    GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init (GPIOJ, &gpio_init_structure);

