mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
    dsiWriteCmd (0, (uint8_t*)ShortRegData33);
    dsiWriteCmd (15, (uint8_t*)lcdRegData12);

    dsiWriteCmd (0, (uint8_t*)ShortRegData29);
    dsiWriteCmd (15, (uint8_t*)lcdRegData13);

    dsiWriteCmd (0, (uint8_t*)ShortRegData30);
    dsiWriteCmd (10, (uint8_t*)lcdRegData14);

    dsiWriteCmd (0, (uint8_t*)ShortRegData31);
    dsiWriteCmd (15, (uint8_t*)lcdRegData15);

    dsiWriteCmd (0, (uint8_t*)ShortRegData32);
    dsiWriteCmd (15, (uint8_t*)lcdRegData16);

    dsiWriteCmd (0, (uint8_t*)ShortRegData34);
    dsiWriteCmd (10, (uint8_t*)lcdRegData17);

    dsiWriteCmd (0, (uint8_t*)ShortRegData35);
    dsiWriteCmd (10, (uint8_t*)lcdRegData18);

    dsiWriteCmd (0, (uint8_t*)ShortRegData2);
    dsiWriteCmd (10, (uint8_t*)lcdRegData19);

    dsiWriteCmd (0, (uint8_t*)ShortRegData33);
    dsiWriteCmd (15, (uint8_t*)lcdRegData20);

    dsiWriteCmd (0, (uint8_t*)ShortRegData29);
    dsiWriteCmd (15, (uint8_t*)lcdRegData21);

    dsiWriteCmd (0, (uint8_t*)ShortRegData30);
    dsiWriteCmd (10, (uint8_t*)lcdRegData22);

    dsiWriteCmd (0, (uint8_t*)ShortRegData31);
    dsiWriteCmd (15, (uint8_t*)lcdRegData23);

    dsiWriteCmd (0, (uint8_t*)ShortRegData32);
    dsiWriteCmd (15, (uint8_t*)lcdRegData24);

    /* PWR_CTRL1 - 0xc580h - 130th parameter - default 0x00 */
    /* Pump 1 min and max DM                                */
    dsiWriteCmd (0, (uint8_t*)ShortRegData13);
    dsiWriteCmd (0, (uint8_t*)ShortRegData47);
    dsiWriteCmd (0, (uint8_t*)ShortRegData48);
    dsiWriteCmd (0, (uint8_t*)ShortRegData49);

    /* Exit CMD2 mode */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);
    dsiWriteCmd (3, (uint8_t*)lcdRegData25);

    // Standard DCS Initialization TO KEEP CAN BE DONE IN HSDT                   */

    /* NOP - goes back to DCS std command ? */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);

    /* Gamma correction 2.2+ table (HSDT possible) */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);
    dsiWriteCmd (16, (uint8_t*)lcdRegData3);

    /* Gamma correction 2.2- table (HSDT possible) */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);
    dsiWriteCmd (16, (uint8_t*)lcdRegData4);

    /* Send Sleep Out command to display : no parameter */
    dsiWriteCmd (0, (uint8_t*)ShortRegData36);

    /* Wait for sleep out exit*/
    HAL_Delay (120);

    //dsiWriteCmd (0, (uint8_t*)ShortRegData37); // Set Pixel color format to RGB565
    dsiWriteCmd (0, (uint8_t*)ShortRegData38); // Set Pixel color format to RGB888

    // portrait by default
    if (landscape) {
      dsiWriteCmd (0, (uint8_t*)ShortRegData39);
      dsiWriteCmd (4, (uint8_t*)lcdRegData27);
      dsiWriteCmd (4, (uint8_t*)lcdRegData28);
      }

    // CABC : Content Adaptive Backlight Control section start
    dsiWriteCmd (0, (uint8_t*)ShortRegData40); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness, try 0x7F : intermediate value
    dsiWriteCmd (0, (uint8_t*)ShortRegData41); // defaut is 0, try 0x2C - Brightness Control Block, Display Dimming & BackLight on
    dsiWriteCmd (0, (uint8_t*)ShortRegData42); // defaut is 0, try 0x02 - image Content based Adaptive Brightness [Still Picture]
    dsiWriteCmd (0, (uint8_t*)ShortRegData43); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness

    /* Send Command Display On */
    dsiWriteCmd (0, (uint8_t*)ShortRegData44);

    /* NOP command */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);

    /* Send Command GRAM memory write (no parameters) : this initiates frame write via other DSI commands sent by */
    /* DSI host from LTDC incoming pixels in video mode */
    dsiWriteCmd (0, (uint8_t*)ShortRegData45);
    }
  //}}}
#endif

//{{{
void cLcd::setLayer (uint8_t layer, uint32_t frameBufferAddress) {

  mCurFrameBufferAddress = frameBufferAddress;
  mSetFrameBufferAddress[layer] = frameBufferAddress;
  }
//}}}
//{{{
void cLcd::showLayer (uint8_t layer, uint32_t frameBufferAddress, uint8_t alpha) {

  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = alpha;
  }
//}}}

//{{{
void cLcd::setFont (const uint8_t* font, int length) {

  FT_Init_FreeType (&FTlibrary);
  FT_New_Memory_Face (FTlibrary, (FT_Byte*)font, length, 0, &FTface);
  FTglyphSlot = FTface->glyph;
  //FT_Done_Face(face);
  //FT_Done_FreeType (library);
  }
//}}}
//{{{
cFontChar* cLcd::loadChar (uint16_t fontHeight, char ch) {

  FT_Set_Pixel_Sizes (FTface, 0, fontHeight);
  FT_Load_Char (FTface, ch, FT_LOAD_RENDER);

  auto fontChar = (cFontChar*)myMalloc (sizeof(cFontChar));
  fontChar->left = FTglyphSlot->bitmap_left;
  fontChar->top = FTglyphSlot->bitmap_top;
  fontChar->pitch = FTglyphSlot->bitmap.pitch;
  fontChar->rows = FTglyphSlot->bitmap.rows;
  fontChar->advance = FTglyphSlot->advance.x / 64;
  fontChar->bitmap = nullptr;

  if (FTglyphSlot->bitmap.buffer) {
    fontChar->bitmap = (uint8_t*)myMalloc (FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
    memcpy (fontChar->bitmap, FTglyphSlot->bitmap.buffer, FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
    }

  auto insertPair = mFontCharMap.insert (cFontCharMap::value_type (fontHeight<<8 | ch, fontChar));
  auto fontCharIt = insertPair.first;

  return fontCharIt->second;
  }
//}}}

//{{{
void cLcd::reset() {

  for (auto i = 0; i < mMaxLine; i++)
    mLines[i].clear();

  mStartTime = osKernelSysTick();
  mLastLine = -1;
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTop() {
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTail() {

  if (mLastLine > (int)mNumDrawLines-1)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  else
    mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::updateNumDrawLines() {

  mStringPos = cWidget::getBoxHeight()*3;

  auto numDrawLines = getLcdHeightPix() / cWidget::getBoxHeight();
  if (mShowTitle && !mTitle.empty())
    numDrawLines--;
  if (mShowLcdStats)
    numDrawLines--;
  if (mShowFooter)
    numDrawLines--;

  mNumDrawLines = numDrawLines;
  }
//}}}
